//
//  紙張尺寸.swift
//  Famliy
//
//  Created by 火靈 鳥 on 2023/12/16.
//

import Foundation
struct 紙張尺寸 {
    let 寬: CGFloat
    let 高: CGFloat
}
let 通用紙張 = [
       "A0": 紙張尺寸(寬: 841, 高: 1189),
       "A1": 紙張尺寸(寬: 594, 高: 841),
       "A2": 紙張尺寸(寬: 594, 高: 420),
       "A3": 紙張尺寸(寬: 420, 高: 297),
       "A4": 紙張尺寸(寬: 210, 高: 297),
       "A5": 紙張尺寸(寬: 148, 高: 210),
       "B0": 紙張尺寸(寬: 1000, 高: 1414),
       "B1": 紙張尺寸(寬: 707, 高: 1000),
       "B2": 紙張尺寸(寬: 500, 高: 707),
       "B3": 紙張尺寸(寬: 353, 高: 500),
       "B4": 紙張尺寸(寬: 250, 高: 353),
       "B5": 紙張尺寸(寬: 176, 高: 250),
       "16K": 紙張尺寸(寬: 184, 高: 260)
]
